---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RevolutionFailures.ProfileNotPlanar
source: html/62c48081-b955-f923-f290-9804049901e5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RevolutionFailures.ProfileNotPlanar Property

The Profile must lie in a plane.

## Syntax (C#)
```csharp
public static FailureDefinitionId ProfileNotPlanar { get; }
```